{
  "common": {
    "status": "Status",
    "create": "Vytvořit",
    "name": "Název",
    "description": "Popis",
    "priority": "Priorita",
    "start": "Začátek",
    "end": "Konec",
    "progress": "Postup",
    "assignedUser": "Přiřazený uživatel",
    "previousActivities": "Předchozí aktivity",
    "details": "Podrobnosti",
    "deleted": "Odstraněno",
    "somethingWentWrong": "Něco se pokazilo :(",
    "home": "Domů",
    "overview": "Přehled",
    "add": "Přidat",
    "createdDate": "Datum Vytvoření",
    "updatedDate": "Datum aktualizace",
    "none": "Žádná",
    "confirmDeleteTitle": "Potvrdit odstranění",
    "confirmDeleteText": "Jste si jistí, že chcete opravdu odstranit?",
    "cancel": "Zrušit",
    "delete": "Odstranit",
    "type": "Typ",
    "accept": "Přijmout",
    "reject": "Odmítnout",
    "calculation": "Výpočet",
    "conditionCheck": "Ověření podmínky",
    "from": "Od",
    "to": "Do",
    "appTitle": "Aplikace pro projektový management",
    "appDescription": "Aplikace demostrujicí využití teorie grafů v reálném světě, konkrétně v oboru projektového řízení. Nástroj je primárně zaměřen na začátečníky v oboru řízení projektu a studenty. Poskytuje základní funkcionalitu pro správu vlastního projektu a detailní popis postupu aplikace metod síťové analýzy na konkrétní uživatelsky vytvořený projekt. Aplikace podporuje tři vybrané nejznámější metody síťové analýzy: CPM, PERT a MPM, které analyzují projekt z časového hlediska.",
    "unauthorized": "Aktuálně k tomuto nemáte přístup, prosím přihlaste se.",
    "appName": "Slice Project"
  },
  "task": {
    "name": "Název úkolu",
    "add": "Přidat úkol",
    "createDialogTitle": "Vytvoření nového úkolu",
    "relatedTasks": "Související úkoly",
    "previousActivities": "Předcházející činnosti",
    "followingActivities": "Následující činnosti",
    "addPreviousActivities": "Přidat předcházející činnost",
    "addFollowingActivities": "Přidat následující činnost",
    "relationSucCreated": "Relace byla úspěšně vytvořena",
    "selectRelatedTask": "Vyberte související úkol",
    "taskSuccessfullyCreated": "Úkol byl úspěšně vytvořen",
    "taskNameMustFilled": "Název úlohy musí být vyplněn",
    "duration": "Délka trvání",
    "activity": "Činnost",
    "followingActivity": "Následující činnost",
    "initialActivity": "Počáteční činnost",
    "endActivity": "Koncová činnost"
  },
  "project": {
    "projects": "Projekty",
    "create": "Vytvořit projekt",
    "successfullyCreated": "Projekt byl úspěšně vytvořen",
    "activities": "Činnosti",
    "cpm": "CPM",
    "pert": "PERT",
    "mpm": "MPM",
    "members": "Členové",
    "projectMembers": "Členové projektu",
    "role": "Role",
    "createDialogTitle": "Vytvořit nový projekt",
    "deleteMember": "Odstranit člena projektu",
    "updateMemberRole": "Role byla úspěšně upravena",
    "successfullyDeletedMember": "Člen týmu byl úspěšně odebrán",
    "createProjectMemberTitle": "Přidat existující uživatele do projektového týmu",
    "successfullyCreatedMember": "Člen týmu byl úspěšně přídán",
    "leave": "Opustit projekt",
    "emptyProjectInfo": "Projekt neobsahuje žádné činnosti.",
    "calculationFailed": "Nastala chyba při výpočtu metody, zkontrolujte činnosti projektu!"
  },
  "user": {
    "myAccount": "Můj účet",
    "settings": "Nastavení",
    "logout": "Odhlásit se",
    "signIn": "Přihlášení",
    "signIn2": "Přihlásit se",
    "username": "Uživatelské jméno",
    "password": "Heslo",
    "registerNow": "Registrujte se nyní",
    "registerQuestion": "Nemáte ještě účet?",
    "register": "Registrace",
    "register2": "Registrovat se",
    "logoutPageTitle": "Opravdu se chcete odhlásit?",
    "firstName": "Jméno",
    "lastName": "Přijmení",
    "fullName": "Celé jméno",
    "email": "Email",
    "invalidCredentials": "Neplatné uživatelské jméno nebo heslo",
    "successfullyRegistered": "Registrace byla úspěšně provedena",
    "assignedTasks": "Přiřazené úkoly",
    "emptyAssignedTasks": "Zde se zobrazí úkoly, které vám byly přiděleny. Akutálně nemáte přiřazeny žádné úkoly.",
    "emptyProjects": "Zde se zobrazí projekty, kterých jste součástí. Akutálně nejste součástí žádného projektu.",
    "accountTitle": "Účet",
    "profile": "Profil"
  },
  "notification": {
    "title": "Oznámení",
    "successfullyConfirmedProjectInvitation": "Pozvánka do projektu byla úspěšně potvrzena",
    "noNotificationsAvailable": "Žádné notifikace nejsou k dispozici"
  },
  "cpm": {
    "name": "CPM",
    "description": "Critical Path Method (CPM) je technika modelování projektů, kterou koncem 50. let 20. století vyvinul Morgan R. Walker ze společnosti DuPont a James E. Kelly Jr. ze společnosti Remington Rand. Kelly přisoudil termín kritická cestavývojářům techniky Program Evaluation and Review Technique (PERT), kterou přibližně ve stejné době vyvinula společnost Booz Allen Hamilton a americké námořnictvo. CPM se běžně používá napříč všemi odvětvími, pro projekty se vzájemně závislými činnostmi. Poprvé byla metoda CPM použitav roce 1966 při výstavbě bývalého Světového obchodního centra v New Yorku. CPM je jedna z nejznámějších a nejrozšířenějších metod síťové analýzy souží k časovéanalýze deterministicky ohodnocených síťových grafů. Vstupem pro výpočet jsou činnosti a číselné ohodnocení, které představuje dobu jejich trvání. Výstupem je identifikace kritické cesty v síťovém grafu a stanovení časových rezerv, které mohou být použity pro důkladnější rozbor časového průběhu projektu.",
    "calculationFailed": "Nastala chyba při výpočtu metody CPM, zkontrolujte činnosti projektu!",
    "errorNonRelatedGraph": "Síťový graf projektu není souvislý",
    "earliestStart": "Termín nejdříve možného začátku činnosti (Earliest Start)",
    "earliestFinish": "Termín nejdříve možného konce činnosti (Earliest Finish)",
    "latestStart": "Termín nejpozději přípustného začátku činnosti (Latest Start)",
    "latestFinish": "Termín nejpozději přípustného konce činnosti  (Latest Finish)",
    "totalFloat": "Celková časová rezerva (Total Float)",
    "freeFloat": "Volná časová rezerva (Free Float)",
    "cpmTableTitle": "Tabulka s výpočtem metody CPM",
    "cpmCalculationTitle": "Postup výpočtu metody CPM",
    "forwardCalculation": "Výpočet vpřed",
    "backwardCalculation": "Výpočet vzad",
    "timeReservesCalculation": "Výpočet časových rezerv",
    "criticalPathDetermining": "Určení kritické cesty",
    "forwardCalculationCaption": "1. Fáze",
    "forwardCalculationDescription": "Během výpočtu směrem vpřed jsou pro každou činnost stanoveny nejdříve možné termíny ES<0>i</0> a EF<0>i</0>. Postupuje se od začátku projektu směrem k jeho konci.",
    "forwardCalculationTitle": "Postup výpočtu 1. fáze",
    "backwardCalculationCaption": "2. Fáze",
    "timeReservesCalculationCaption": "Vyhodnocení rezerv činností",
    "criticalPathDeterminingCaption": "Poslední krok",
    "calculationProcedureDescription": "Výpočet metody CPM lze rozdělit do následujících kroků, které vedou k určení časových rezerv činností, kritických činností a kritické cesty.",
    "resultsTableDescription": "Tabulka obsahuje pro všechny činnosti projetku jednotlivé vypočítané hodnoty pomocí metody CPM, kritické činnosti jsou zvýrazněny červeně.",
    "forwardESCalculation": "Termín nejdříve možného začátku činnosti (ES = Earliest Start) je pro počáteční činnosti roven nule. Pro ostatní je určen jako maximální hodnota z množiny termínů nejdříve možných konců bezprostředních předchůdců.",
    "forwardEFCalculation": "Termín nejdříve možného konce činnosti (EF = Earliest Finish) je roven součtu termínu nejdříve možného začátku činnosti a její doby trvání.",
    "backwardCalculationTitle": "Postup výpočtu 2. fáze",
    "backwardCalculationDescription": "Během výpočtu směrem vzad jsou pro každou činnost stanoveny nejpozději možné termíny LS<0>i</0> a LF<0>i</0>. Postupuje se od konce projektu směrem k jeho počátku.",
    "forwardLSCalculation": "Termín nejpozději přípustného začátku činnosti (LS Latest Start) je roven rozdílu termín nejpozději přípustného konce činnosti a její doby trvání.",
    "forwardLFCalculation": "Termín nejpozději přípustného konce činnosti (LF = Latest Finish) je pro koncové činnosti roven termín nejdříve možného konce činnosti. Pro ostatní je učen jako minimální hodnota z množiny termínů nejpozději přípustných začátků bezprostředních následovníků činnosti.",
    "floatCalculationTitle": "Postup výpočtu časových rezerv",
    "floatCalculationDescription": "Jednou z důležitých charakteristik projektu jsou časové rezervy činností, které hrají důležitou roli při analýze jednotlivých činností z časového hlediska. Jedná se o poslední krok výpočtu, ze kterého se následně určuje výsledná kritická cesta. V tomto kroku jsou pro každou činnost určeny jednotlivé časové rezervy TS<0>i</0> a FS<0>i</0>.",
    "floatTSCalculation": "Celková časová rezerva (TS = Total Slack) představuje dobu, o kterou lze činnost zpozdit od plánovaného začátku oproti termínu nejdříve možného začátku nebo o kolik lze prodloužit její trvání, aniž by to nemělo vliv na zpoždění časového harmonogramu celého projektu. Používá se k určení kritických činností, jejichž celková časová rezerva je rovna nula.",
    "floatFSCalculation": "Volná časová rezerva (FS = Free Slack) je doba, o kterou může být činnost zpožděna od svého nejdříve možného času zahájení nebo o kolik je možné prodloužit trvání činnosti, aniž by se zpozdil čas nejdříve možných začátků kterékoli z bezprostředně následujících činností.",
    "criticalPathTitle": "Určení výsledné kritické cesty",
    "criticalPathDescription": "V síťovém grafu kritická cesta představuje spojení od počátečního ke koncovému uzlu, na kterém leží pouze aktivity s nulovou celkovou časovou rezervou (TS). O všech činnostech, které jsou součástí kritické cesty, hovoříme jako o kritických. Při zpoždění libovolné kritické činnosti dojde k prodloužení celkové doby trvání projektu. Kritická cesta je zároveň z časového hlediska nejdelší cestou v síťovém grafu",
    "criticalActivities": "Kritické činnosti",
    "criticalActivitiesDescription": "Jedná se o činnosti projektu, které mají nulovou celkovou časovou rezervu.",
    "estimatedProjectDuration": "Předpokládaná doba trvání celého projektu",
    "estimatedProjectDurationDescription": "Předpokládaná doba trvání celého projektu T<0>P</0> se určí jako součet dob trvání kritických činností. Udává termín nejdříve možné realizace celého projektu."
  },
  "pert": {
    "name": "PERT",
    "description": "Program Evaluation and Review Technique (PERT) je široce používaná metoda pro plánování a koordinaci rozsáhlých projektů, kterou v roce 1958 vyvinulo americké námořnictvo společně s dodavateli pracujícími na projektu raket Polaris. Americká vláda se obávala rostoucího jaderného arzenálu Sovětského svazu a chtěla projekt Polaris dokončit co nejrychleji. Námořnictvo použilo techniku PERT ke koordinaci přibližně 3000 dodavatelů, a to vedlo ke zkrácení doby trvání projektu o 2 roky. PERT rozšiřuje metodu CPM o analýzu projektu při variabilní době trvání činností (stochastické časové ohodnocení činností). V reálném světě jsou činnosti projektu často náchylné k nejistotám, které mohou ovlivnit skutečnou dobu trvání. V metodě PERT se potencionální nejistota doby trvání zohledňuje pomocí tří časových odhadů pro každou činnost: optimistický, modální a pesimistický.",
    "inputTableTitle": "Vstupní hodnoty pro výpočet metody PERT",
    "inputTableTitleDescription": "PERT rozšiřuje metodu CPM o analýzu projektu při variabilní době trvání činností (stochastické časové ohodnocení činnost). V metodě PERT se potencionální nejistota doby trvání zohledňuje pomocí tří časových odhadů pro každou činnost. Před započetím výpočtu je nutné pro každou činnost definovat tyto časové odhady.",
    "optimisticEstimation": "Optimistický odhad",
    "modalEstimation": "Modální odhad",
    "pessimisticEstimation": "Pesimistický odhad",
    "averageDuration": "Střední doba trvání",
    "standardDeviation": "Směrodatná odchylka",
    "dispersion": "Rozptyl",
    "calculationTitle": "Postup výpočtu metody PERT",
    "calculationTitleDescription": "Výpočet metody se skládá z několika kroků, které jsou založeny na výpočtu metody CPM. PERT rozšiřuje metodu CPM o analýzu projektu při variabilní době trvání činností.",
    "firstStepCalculation": "Výpočet střední hodnoty, směrodatné odchylky a rozptylu",
    "firstStepCalculationCaption": "Výpočet střední hodnoty, směrodatné odchylky a rozptylu",
    "criticalPathCalculation": "Určení kritické cesty",
    "criticalPathCalculationCaption": "Využití metody CPM",
    "finalStepCalculation": "Výpočet střední doby trvání a rozptylu projektu",
    "finalStepCalculationCaption": "Určení pravděpodobnosti dokončení projektu",
    "estimationConditionNotFulfilled": "Pro časové odhady neplatí podmínka: 0 ≤ Optimistický odhad ≤ Modální odhad ≤ Pesimistický odhad",
    "firstStepCalculationStepContentTitle": "Výpočet střední doby trvání, směrodatné odchylky a rozptylu doby trvání",
    "firstStepCalculationStepContentTitleDescription": "Z hodnot časových odhadů (optimistický, modální a pesimistický) se pro každou činnosti určuje střední hodnota (střední doba trvání), směrodatná odchylka a rozptyl, které jsou dále použity ve výpočtu metody PERT. Před samotným výpočtem musí být pro každou činnost tyto časové odhady definovány a zároveň musí být splněna podmínka: : 0 ≤ Optimistický odhad ≤ Modální odhad ≤ Pesimistický odhad",
    "averageDurationCalculation": "𝜇<0>i</0> - střední doba trvání činnosti",
    "standardDeviationCalculation": "𝜎<0>i</0> - směrodatná odchylka doby trvání",
    "dispersionCalculation": "𝜎<2>2</2><0>i</0> - rozptyl doby tvání",
    "activitiesNotFilledTimeEstimate": "Všechny aktivity nemají vyplněné časové odhady, nelze provést výpočet metody PERT",
    "cpmCalculationTitle": "Výpočet kritické cesty",
    "cpmCalculationTitleDescription": "Výpočet kritické cesty je realizován stejně jako u metody CPM, ale namísto deterministických hodnot délky trvání t<0>i</0> výpočet využívá střední dobu trvání činností 𝜇<0>i</0>.",
    "cpmCalculationFailed": "Během výpočtu kritické cesty došlo k chybě, zkorolujte zadané hodnoty a provázanost činností",
    "calculationFailed": "Nastala chyba při výpočtu metody PERT, zkontrolujte činnosti projektu!",
    "lastStepCalculationTitle": "Finální analýza stochasticky časově ohodnoceného projektu",
    "lastStepCalculationTitleDescription": "V tomto kroku je určena střední doby trvání projektu 𝜇<0>T</0>, rozptyl délky trvání projektu 𝜎<1>2</1><0>T</0>, směrodatnou odchylka 𝜎<0>T</0> a pravděpodobnost dokončení projektu v očekávaném intervalu.",
    "averageProjectDuration": "Výpočet střední doba trvání projektu",
    "averageProjectDurationCaption": "Střední doba trvání projektu - 𝜇<0>T</0> se určí jako součet středních dob trvání činností, které leží na kritické cestě.",
    "totalProjectDispersion": "Celkový rozptyl doby trvání projektu",
    "totalProjectDispersionCaption": "Rozptyl doby trvání projektu - 𝜎<1>2</1><0>T</0> se určí jakou součet rozptylů činností, které leží na kritické cestě.",
    "projectStandardDeviation": "Směrodatná odchylka doby trvání projektu",
    "projectStandardDeviationCaption": "Směrodatná odchylka doby trvání projektu - 𝜎<0>T</0> se určí jako odmocnina z celkového rozptylu doby trvání projektu.",
    "probabilityProjectCompletionTime": "Pravděpodobnost dokončení projektu v čase T<0>P</0>",
    "probabilityProjectCompletionTimeDescription": "Pravděpodobnost dokončení projektu v čase T, který nepřekročí plánovaný čas dokončení projektu T<0>P</0>, je rovna hodnotě distribuční funkce normálního rozdělení N(0, 1).",
    "projectCompletionTimeProbability": "Čas dokončení projektu s pravděpodobností <0>p</0>",
    "projectCompletionTimeProbabilityDescription": "Při obrácení výpočtu pravděpodobnosti dokončení projektu v čase T<0>P</0> je možné určit v jakém čase bude projekt dokončen s pravděpodobností <1>p</1>"
  },
  "mpm": {
    "name": "MPM",
    "description": "Přibližně ve stejné době, kdy se ve Spojených státech rozvíjely metody PERT a CPM, vyvinul v roce 1958 Bernard Roy ve Francii metodu Metra Potential Method (MPM). Její prvotní použití bylo pro stavbu francouzských jaderných elektráren. Tato metoda setaké někdy označuje pojmy „potenciální metoda“ nebo „metoda potenciálu úlohy“ a je široce využívána v oblasti softwarových nástrojů pro projektový management (pro grafickou reprezentaci činností projektu). Metoda MPM byla navržena tak, aby byla více flexibilnější než metody PERT a CPM. Flexibilita této metody je postavena na využití uzlově ohodnocených grafů (přístup AON), které se snadněji vytvářejí a čtou. Patří mezi nejznámější využití uzlově ohodnocených síťových grafů a slouží k analýze projektu z časového hlediska při deterministickém ohodnocením. Oproti metodě CPM využívá dva speciální typy vztahů mezi činnostmi, které představují nejkratší a nejdelší časový rozestup činností.",
    "inputTableTitle": "Časové rozestupy činností",
    "inputTableTitleDescription": "Metoda MPM a slouží k analýze projektu z časového hlediska při deterministickém ohodnocením. Oproti metodě CPM využívá dva speciální typy vztahů mezi činnostmi, které představují nejkratší a nejdelší časový rozestup činností <0>i</0> a <0>j</0>. Pokud tyto hodnoty nejsou vyplněny, tak minimální časový odstup je roven nule (a = 0) a maximální časový odstup je roven mínus nekonečnu (b = - ∞).",
    "minimumTimeGap": "Minimální časový odstup",
    "maximumTimeGap": "Maximální časový odstup",
    "timeGapConditionNotFulfilled": "Kladný potenciál musí být menší nebo roven absolutní hodnotě záporného potenciálu.",
    "calculationTitle": "Postup výpočtu metody MPM",
    "calculationTitleDescription": "Vstupními informacemi pro časovou analýzy pomocí metody MPM je seznam činností a pro každou činnost <0>i</0> informace o: době trvání t<1>i</1>, vzájemné vazby mezi činnostmi a jejich kladné a záporné potenciály. Postupně jsou pro jednotlivé činnosti určeny termíny ES<1>i</1>, EF<1>i</1>, LS<1>i</1> a LF<1>i</1>. Tyto termíny slouží jako podklad pro stanovení časových rezerv a kritické cesty. Výpočet je podobný jako u metody CPM a je opět realizován ve fázích vpřed a vzad. Rozdíl je v zohlednění kladných a záporných vazeb ve výpočtu.",
    "forwardCalculation": "Výpočet vpřed",
    "forwardCalculationCaption": "1. Fáze",
    "backwardCalculation": "Výpočet vzad",
    "backwardCalculationCaption": "2. Fáze",
    "timeReservesCalculation": "Výpočet časových rezerv",
    "timeReservesCalculationCaption": "Určení rezerv činností",
    "criticalPathDetermining": "Určení kritické cesty",
    "criticalPathDeterminingCaption": "Finální výsledek",
    "forwardCalculationTitle": "Postup výpočtu 1. fáze",
    "forwardCalculationDescription": "Výpočet metody MPM opět začína v před od počáteční činnosti a pro každou činnost jsou stanoveny nejdříve možné termíny začátku ES<0>i</0> a konce EF<0>i</0> činnosti. Při každém kroku výpočtu se kontorluje podmínka ES<0>j</0> - EF<0>i</0> ≤ b<0>ij</0>.",
    "previousActivitiesDescription": "V seznamu předchůdců jsou pro každou činnost uvedeny hodnoty termínu nejdříve možného konce (EF) a minimálního časového odstupu mezi událostmi (A).",
    "forwardESCalculation": "Obdobně jako u metody CPM jsou položeny nejdříve možné termíny startu všech počátečních činností nule. Pro všechny ostatní činnosti se ES určí jako rozdíl mezi termínem nedříve možného konce a doby trvání činnosti.",
    "forwardEFCalculation": "Nejdříve možné termíny konce všech počátečních činností jsou rovny době trvání činnosti. Následně pro další činnosti projektu je termín nejdříve možného konce činnosti roven maximální hodnotě z množiny hodnot bezprostředních předchůdců určené jako EF<0>h</0> + a<0>hj</0> + t<0>j</0>.",
    "forwardCalculationCondition": "Pro hodnoty ES<0>j</0> a EF<0>i</0> přitom musí platit podmínka ES<0>j</0> − EF<0>i</0> ≤ b<0>ij</0>. Pokud vypočtené hodnoty nesplňují tyto kritéria, tak se výpočet zastaví a je nezbytné upravit hodnoty a<0>ij</0>, b<0>ij</0> a nebo t<0>i</0>, t<0>j</0>.",
    "forwardCalculationFailed": "Výpočet vpřed nebyl úspěšně dokončen!",
    "notFulfilledRelationships": "Pro následující činnosti nejsou splněny kritéria:",
    "forwardCalculationConditionSubstitute": "U činností bez předchůdců se neprovádí kontrola kritérií.",
    "backwardCalculationFailed": "Výpočet vzad nebyl úspěšně dokončen!",
    "backwardCalculationTitle": "Postup výpočtu 2. fáze",
    "backwardCalculationTitleDescription": "Výpočet vzad postupuje od koncové činnosti směrem zpět a určuje nejpozději přípustné termíny začátku LS<0>i</0> a konce LF<0>i</0> činnosti. Při každém kroku se kontroluje podmínka LS<0>i</0> - LF<0>j</0> ≤ b<0>ij</0>",
    "backwardLSCalculation": "Nejpozději možné termíny začátku všech koncových činností jsou rovny rozdílu termínu nejpozději přípustného konce a doby trvání činnosti. Následně pro další činnosti projektu je termín nejpozději možného začáktu činnosti roven minimální hodnotě z množiny hodnot bezprostředních následovníků určené jako LS<0>j</0> - a<0>ij</0> - t<0>i</0>.",
    "backwardLFCalculation": "Nejpozději možné termíny konce koncových činnosti jsou rovny jejich nejdříve možnému konci. Pro ostatní činnosti jsou určeny jako součet nejpozději přípustného startu a trvání činnosti.",
    "backwardCalculationConditionSubstitute": "U činností bez následovníků se neprovádí kontrola kritérií.",
    "backwardCalculationCondition" : "Pro hodnoty LS<0>j</0> a LF<0>i</0> přitom musí platit podmínka LS<0>j</0> − LF<0>i</0> ≤ b<0>ij</0>. Pokud vypočtené hodnoty nesplňují tyto kritéria, tak se výpočet zastaví a je nezbytné upravit hodnoty a<0>ij</0>, b<0>ij</0> a nebo t<0>i</0>, t<0>j</0>.",
    "followingActivitiesDescription": "V seznamu následníků jsou pro každou činnost uvedeny hodnoty termínu nejpozději možného začátku (LS) a minimálního časového odstupu mezi událostmi (A).",
    "reservesCalculationTitle": "Postup výpočtu 3. fáze",
    "reservesCalculationTitleDescription": "V této fázi jsou využity vypočtené termíny z předešlých fázích pro stanovení časových rezerv. V praxi se v drtivé většině případů používá jenom celková časová rezerva. Činnosti s nulovou celkovou časovou rezervou tvoří kritickou cestu.",
    "calculationTableTitle": "Tabulka s výpočtem metody MPM",
    "calculationTableTitleDescription": "Tabulka obsahuje pro všechny činnosti projetku jednotlivé vypočítané hodnoty pomocí metody MPM, kritické činnosti jsou zvýrazněny červeně."
  },
  "ganttChart": {
    "title": "Gantův diagram",
    "tooltipDuration": "Doba trvání: {{day}} dnů",
    "tooltipProgress": "Postup: {{progress}} %"
  },
  "tutorial": {
    "title": "Tutoriál",
    "description": "Tutoriál složí jak návod pro použití aplikace. Popisuje na konkrétních případech klíčové funkcionality nástroje. Průvodce má uživatelům pomoci pochopit, jak používat určitou funkcionalitu nástroje. Hlavním cílem tutoriálu je usnadnit a zefektivnit proces učení tím, že rozdělí vlastnosti a funkce aplikace do zvládnutelných kroků.",
    "goToTutorial": "Přejít na tutoriál",
    "registrationAndLoginTitle": "Registrace a přihlášení",
    "registrationAndLoginCaption": "Vytvoření uživatelského účtu",
    "overviewTitle": "Přehled",
    "overviewCaption": "Zobrazení přiřazených úkolů",
    "projectsTitle": "Projekty",
    "projectsCaption": "Práce s projekty",
    "tasksTitle": "Činnosti",
    "tasksCaption": "Správa činností projektu",
    "ganttChartTitle": "Ganttův diagram",
    "ganttChartCaption": "Zobrazení posloupnosti činností pomocí diagramu",
    "networkAnalysisTitle": "Metody síťové analýzy",
    "networkAnalysisCaption": "Popis postupu analýzy projektu",
    "registrationAndLoginText1": "V této části se dozvíte, jak se zaregistrovat nebo přihlásit do aplikace pro projektový management. Většina funkcí aplikace je dostupná až po přihlášení.",
    "registrationAndLoginText2": "Prvním krokem při práci s PMS je vytvoření uživatelského účtu. K registraci do systému je nutné vyplnit jméno, příjmení, email, uživatelské jméno a heslo. Chcete-li se zaregistrovat přejděte na <0>registrační formulář</0> a postupujte podle pokynů níže.",
    "registrationAndLoginText3": "Vyplňte formulář a následně klikněte na modré tlačítko <0>Registrovat se</0>. Nezapomeňte si zapamatovat heslo a uživatelské jméno, abyste se mohli později znovu přihlásit.",
    "registrationAndLoginText4": "Pro přihlášení do PMS přejděte na <0>přihlašovací formulář</0> a vyplňte validní uživatelské jméno a heslo. Stisknutím tlačítka <1>Přihlásit se</1> dojde k přihlášení a přesměrování na domovskou obrazovku.",
    "registrationAndLoginSubtitle1": "Registrace nového uživatele",
    "registrationAndLoginSubtitle2": "Přihlášení s aktivním účtem",
    "overviewText1": "Na stránce přehledu se zobrazují důležité informace o přiřazených úkolech a projektech, kterých jste součástí. Na přehled se dostanete pomocí levého navigačního menu (záložka <0>Přehled</0>) a nebo pomocí <1>následujícího odkazu</1>.",
    "overviewText2": "Samotná stránka přehledu se skládá z dvou částí. Záložka <0>Přiřazené úkoly</0> zobrazuje akutálně přiřazené činnosti k řešení a záložka <0>Projekty</0> zobrazuje seznam všech projektů. Na jednotlivé prvky ze seznamu lze kliknout a dojde k přesměrování na detail úkolu nebo projektu.",
    "projectsText1": "Tato sekce Vás seznámí s projekty, které tvoří klíčovou část aplikace. Projekt je definován jako dočasná, cílená snaha o vytvoření jedinečného výstupu. Projekt je realizován pomocí dílčích činností, které posouvají projekt směrem k cíly.",
    "projectsText2": "Nový projekt lze vytvořit pomocí dvou tlačítek <0>Vytvořit projekt</0>. Jedno je umístěno v levém menu aplikace a druhé na přehledu všech projektů. Po kliknutí dojde k otevření formuláře pro vytvoření projektu.",
    "projectsText3": "Pro vytvoření nového projektu je nutné vyplnit název projektu a zvolit jeho typ (privátní nebo veřejný). Volitelně je možné vyplnit pole popisu projektu. Stisknutím tlačítka <0>Vytvořit</0> dojde k vytvoření nového projektu.",
    "projectsText4": "Chcete-li zobrazit všechny své projekty, v nichž jste členem, tak klikněte na tlačítko <0>Projekty</0> v levém podmenu pro projekty. Seznam všech projektů se zobrazuje i v levém hlavním menu.",
    "projectsText5": "Přehled všech projektů poskytuje detailnější informace o projektech a kliknutím na název projektu budete přesměrování na detail projektu.",
    "projectsText6": "Stránka detailu projektu poskytuje všechny detailní informace o projektu a slouží jako rozcestník pro práci s konkrétním projektem. Zobrazuje seznam všech činností projektu, Ganttův diagram a výpočty jednotlivých metod síťové analýzy. Uživatel s patřičnými právy může v projektu vytvářet nové činnosti a editovat informace o projektu.",
    "projectsText7": "Po stisknutí tlačítka <0>Členové</0> na detailu projektu budete přesměrováni na obrazovku s členy projektového týmu. Seznam obsahuje všechny aktivní členy a jejich detailnější informace. U jednotlivých členů je možné změnit jejich roli a případně je vyřadit z projektového týmu.",
    "projectsText8": "K vytvoření pozvánky do projektu slouží formulář, který se Vám zobrazí po stisknutí tlačítka <0>Přidat</0>. K vytvoření pozvánky je nutné vyplnit email nového člena a následně jeho roli v projektu. Stisknutím tlačítka <0>Vytvořit</0> dojde k odeslání pozvánky do projektu.",
    "projectsSubtitle1": "Vytvoření nového projektu",
    "projectsSubtitle2": "Zobrazení všech projektů",
    "projectsSubtitle3": "Detail projektu",
    "projectsSubtitle4": "Členové projektu",
    "tasksText1": "Projektové činnosti jsou konkrétní, realizovatelné kroky, které je třeba dokončit, aby bylo dosaženo cílů projektu. Rozdělují projekt na zvládnutelné součásti, což usnadňuje plánování, realizaci, monitorování a kontrolu celého projektu. Pro práci s činnostmi slouží detaital projektu, který Vám zobrazuje seznam všech činností projektu a v tabulce můžete editovat jednotlivá pole činností.",
    "tasksText2": "K vytvoření nové činnosti slouží formulář, který se Vám zobrazí po kliknutí na tlačítko <0>Přidat úkol</0>, které je umístěno pod seznamem všech činností. V dialogu musíte vyplnit název činnosti a její dobu trvání (časové rozmezí), ostatní pole nejsou povinná. Všechny vyplněné údaje lze následně editovat. Kliknutím na tlačítko <0>Vytvořit</0> vytvoříte novou činnost projektu.",
    "tasksText3": "Stánka detailu činnosti Vám poskytuje všechny potřebné informace o činnosti na jednom místě. Základní informace jsou rozšířeny o vzájemné vztahy mezi dalšími činnostmi projektu. Pokud máte potřebnou roli v projektu, tak můžete činnost editovat a automaticky dochází k ukládání.",
    "tasksSubtitle1": "Vytvoření činnosti",
    "tasksSubtitle2": "Detail činnosti",
    "ganttChartText1": "Ganttův diagram graficky zobrazuje činnosti projektu na časové ose. Můžete díky tomu mít k dispozici časový harmonogram projektu a návaznosti dílčích činností. Přímo v Ganttově diagramu je vyznačena kritická cesta. Ganttův diagram umožňuje editovat časové rozmezí činností a jejich postup.",
    "networkAnalysisText1": "Na základě seznamu činností projektu Vám systém poskytuje automatický výpočet metod CPM, PERT a MPM. Podmínkou pro realizaci výpočtu je vyplnění všech potřebných číselných charakteristik, které se liší v závislosti na konkrétní metodě. Výsledek analýzy, postup výpočtu a jednotlivé dílčí výsledky, které vedou k finálnímu výsledku jsou přehledně prezentovány.",
    "networkAnalysisText2": "Postup výpočtu metody CPM je rozdělen do čtyř dílčích kroků, mezi kterými lze libovolně přepínat. Každý z kroku detailně popisuje dílčí výpočty pro jednotlivé činnosti projektu. Výstupem je kritická cesta projektu a časové rezervy jednotlivých činností. Pokud najedete kurzorem na vzorec, tak dojde k zobrazení krátkého popisu výpočtu. Informační ikony fungují stejným způsobem.",
    "networkAnalysisText3": "Všechny vypočtené hodnoty si můžete zobrazit v sumarizační tabulce, které obsahuje všechny činnosti projektu. Činnosti vyznačené červenou barvou jsou kritické.",
    "networkAnalysisText4": "PERT rozšiřuje metodu CPM o analýzu projektu při variabilní době trvání činností (stochastické časové ohodnocení činnost). V metodě PERT se potencionální nejistota doby trvání zohledňuje pomocí tří časových odhadů pro každou činnost. Před započetím výpočtu musíte pro každou činnost definovat tyto časové odhady, jinak nelze realizovat výpočet.",
    "networkAnalysisText5": "Výpočet je založen na metodě CPM, ale pracuje se s variabilní dobou trvání činností. Finální výpočet poskytuje výpočet střední doby trvání projektu a pravděpodobnost dokončení projektu v učitém čase.",
    "networkAnalysisText6": "Metoda MPM a slouží k analýze projektu z časového hlediska při deterministickém ohodnocením. Oproti metodě CPM využívá dva speciální typy vztahů mezi činnostmi, které představují nejkratší a nejdelší časový rozestup činností. Pro každý vztah činností můžete definovat minimální a maximální časový rozestup, který se následně zohlední ve výpočtu. K tomu slouží tabulka <0>Časové rozestupy činností</0>, pomocí které můžete definovat tyto časové rozestupy.",
    "networkAnalysisText7": "Výpočet je jako v případě CPM rozdělen do čtyř kroků, které jsou následně rozpadnuty na dílčí výpočty. Každý z těchto kroků je interaktivní a můžete libovoně procházet jednotlivé kroky.",
    "networkAnalysisSubtitle1": "Výpočet metody CPM",
    "networkAnalysisSubtitle2": "Výpočet metody PERT",
    "networkAnalysisSubtitle3": "Výpočet metody MPM"
  },
  "projectRole": {
    "OWNER": "Vlastník",
    "MANAGER": "Manažer",
    "READER": "Návštěvník",
    "MEMBER": "Člen týmu"
  },
  "priority": {
    "URGENT": "Urgentní",
    "HIGH": "Vysoká",
    "NORMAL": "Normální",
    "LOW": "Nízká"
  },
  "status": {
    "NEW": "Nový",
    "ON_HOLD": "Pozastaveno",
    "WAITING": "Čeká na zahájení",
    "IN_PROGRESS": "Probíhá",
    "DONE": "Dokončeno"
  },
  "projectMemberStatus": {
    "ACTIVE": "Aktivní",
    "WAITING_FOR_CONFIRMATION": "Čeká na přijetí",
    "CONFIRMATION_REJECTED": "Pozvánka zamítnuta",
    "USER_LEFT_TEAM": "Opustil tým"
  },
  "notificationType": {
    "PROJECT_INVITATION": "Pozvánka do projektu"
  },
  "projectType": {
    "PRIVATE": "Privátní",
    "PUBLIC": "Veřejný"
  },
  "viewMode": {
    "Hour": "Hodiny",
    "Quarter Day": "Čtvrt dne",
    "Half Day": "Půl dne",
    "Day": "Dny",
    "Week": "Týdny",
    "Month": "Měsíce",
    "Year": "Roky"
  },
  "projectStatus": {
    "NEW": "Nový",
    "IN_PROGRESS": "Probíhá",
    "FINISHED": "Dokončen",
    "CANCELLED": "Zrušen"
  },
  "yup": {
    "string": {
      "email": "Neplatný e-mail",
      "min": "Pole neobsahuje minimální počet znaků",
      "max": "Pole obsahuje více než povolený počet znaků",
      "strongPassword": "Heslo musí obsahovat kombinaci malých a velkých písmen, číslic a symbolů"
    },
    "mixed": {
      "required": "Toto pole je povinné"
    }
  }
}